/******************************************************************************
 *
 *  C header file : final.h
 *  Project       : Tony Compiler
 *  Version       : 1.0 alpha
 *  Written by    : Manolis	Androulidakis
 *  Date          : September 28, 2014
 *  Description   : Final code structures and functions
 *
 *  ---------
 *  Εθνικό Μετσόβιο Πολυτεχνείο.
 *  Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών.
 *  Τομέας Τεχνολογίας Πληροφορικής και Υπολογιστών.
 *  Εργαστήριο Τεχνολογίας Λογισμικού
 */

#include "intermediate.h"

#ifndef __FINAL_H__
#define __FINAL_H__


/* ---------------------------------------------------------------------
   --------------------------- Ορισμός τύπων ---------------------------
   --------------------------------------------------------------------- */


/* ---------------------------------------------------------------------
   ------------------ Ορισμός καθολικών μεταβλητών ---------------------
   --------------------------------------------------------------------- */


/* ---------------------------------------------------------------------
   --------------- Πρωτότυπα των βοηθητικών συναρτήσεων ----------------
   --------------------------------------------------------------------- */

// --- internal --- //
/*
void	load			(char * reg, Operand o);
void	loadAddr		(char * reg, Operand o);
void	store			(char * reg, Operand o);
void	getAR			(SymbolEntry * s);
void	updateAL		();

char *	name			(Operand o);
char *	endof			(Operand o);
char *	label			(Operand o;

char *	str				(const char *s, ...);
// --------------- //
*/

void	skeletonBegin	(const char * progname);
void	skeletonEnd		();
void	printFinal		();


#endif
